 Author: D.Kirthik

Bootcamp: Python and Data Analysis, ShapeAI

Project: Titanic_survivors project

In [ ]:
#importing the necessary libraries of Python
import pandas as pd
import numpy as np

In [ ]:
#Reading data using pandas
df=pd.DataFrame(pd.read_csv('/train (1).csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
 
#shape of dataset
df.shape

(891, 12)

In [ ]:
 
#description of dataFrame
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [ ]:
#size of dataframe
size= df.shape[0]*df.shape[1]
print('size is',size) 
df.size

size is 10692

10692

In [ ]:
 
#counting the null values in each columns
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
x=df.isnull().sum() 
x
thir_five=int(35/100*df.shape[0]) 
print(thir_five)

311

In [ ]:
 
#find the columns to be dropped when it has more than 35% missing values of data set
drop_col=x[x> (35/100 * df.shape[0])]

In [ ]:
drop_col

Cabin    687
dtype: int64

In [ ]:
 
#index of column to be dropped
drop_col.index

Index(['Cabin'], dtype='object')

In [ ]:
 
#drop the column that selected
df.drop(drop_col.index, axis=1, inplace =True)

In [ ]:
 
#check the null values in each column again
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
 
#fill the missing values with mean values
df.fillna(df.mean(), inplace=True)

In [ ]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [ ]:
df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [ ]:
 
#fill the missing values of embarked column with 'S' as it is top value of that column
df['Embarked'].fillna('S', inplace=True)

In [ ]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
 
#correlation between all columns
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

In [ ]:
 
#Familysize column is sum of both values of sibsp and parch columns
df['FamilySize']=df['SibSp']+df['Parch']

In [ ]:
 
#dropping the sibsp and parch columns
df.drop(['SibSp', 'Parch'],axis=1, inplace=True)

In [ ]:
 
#correlation between columns
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500    0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566   -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000    0.217138
FamilySize     -0.040143  0.016639  0.065997 -0.248512  0.217138    1.000000

In [ ]:
 
#Alone column has 0 value if familySize has more than value 0 otherwise 1
df['Alone']=[0 if df['FamilySize'][i]>0 else 1 for i in df.index]

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1         0       3  ...        S          1      0
1            2         1       1  ...        C          1      0
2            3         1       3  ...        S          0      1
3            4         1       1  ...        S          1      0
4            5         0       3  ...        S          0      1

[5 rows x 11 columns]

In [ ]:
 
#Alone column here to be group by survived
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

In [ ]:
 
#correlation between Alone and fare
df[['Alone', 'Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

In [ ]:
 
#Column sex can has 0 value if male otherwise it can have value 1
df['Sex']=[0 if df['Sex'][i]=='male' else 1 for i in df.index]

In [ ]:
 
#Sex column values to be Grouped by mean of survived rate
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

In [ ]:
 
#Embarked Column's values to be grouped by mean of survived rate
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

 Conclusion:
1. Female passengers were prioritised over men
2. People with high class or rich people have higher survival rage than others. 
Hierarchy might have been followed while saving the passengers. 
3.Passengers traveling with thier family have higher survival rate. 
4. Passengers who bored the embarked the ship at Cherbourg survived rate is high. 
5.Alone people has less survival rate than people with family.